package EC1019July2015.Words;

import java.io.BufferedReader;
import java.io.IOException;
import java.io.InputStreamReader;
//import java.util.Scanner;

public class P01 {
    public static void main(String[] args) throws IOException {
        BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));
        //Scanner scan = new Scanner(System.in);
        String input = reader.readLine();

        String[][] allSp={
                { "Биология", "Екология и опазване на околната среда", "Молекулярна биология", "Екология на биотехнологичните производства", "Медицинска биология", "Биоинформатика", "Фармацевтични биотехнологии", "Биология и химия", "Биология и английски език" },
                { "Философия", "История", "Социология и науки за човека", "Социология на правото, иконом. и иновациите", "Етнология", "Културен туризъм", "Археология", "Социална антропология", "Теология", "История и чужд език", "Европеистика - платено обучение" },
                { "Българска филология", "Славистика - полски ез, чешки ез, сръбски и хърватски ез", "Английска филология", "Руска филология", "Френска филология", "Балканистика", "Приложна лингвистика", "Лингвистика с информационни технологии", "Български език и история", "Български език и английски език", "Български език и френски език", "Български език и немски език", "Български език и италиански език", "Български език и руски език", "Български език и испански език", "Български език и новогръцки език", "Български език и турски език", "Български език и китайски език", "Български език и корейски език", "Лингвистика с маркетинг", "Лингвистика с бизнес администрация" },
                { "Инженерна физика", "Телекомуникационни и информационни системи", "Телекомуникации с мениджмънт", "Информационно и компютърно инженерство", "Екоенергийни технологии", "Физика и астрономия", "Физика и математика" },
                { "Математика", "Приложна математика", "Бизнес математика", "Информатика", "Бизнес информационни технологии", "Софтуерни технологии и дизайн", "Софтуерно инженерство", "Инф. техн., математика и обр. мениджмънт", "Математика и информатика" },
                { "Химия", "Компютърна химия", "Медицинска химия", "Химия с маркетинг", "Анализ и контрол" },
                { "Макроикономика", "Маркетинг", "Международни икономически отношения", "Финанси", "Счетоводство", "Стопанско управление", "Публична администрация", "Мениджмънт на туристическия бизнес", "Политология" }
        };

    }
}
